1c_um/src/InformationRegisters/ум_ПакетыДанных/ум_ПакетыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ПакетыДанных</name>
  <resources>
    <name>ВременнаяМеткаСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КлючАналитикиПакетаДанных</name>
    <type>
      <types>CatalogRef.ум_КлючиАналитикиПакетовДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующейОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьОбработки</name>
    <comment>Длительность обработки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРабочегоПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПакетПрипаркован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/InformationRegisters/ум_ПакетыДанныхДанные/ум_ПакетыДанныхДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ПакетыДанныхДанные</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/Enums/ум_СостоянияПакетаДанных/ум_СостоянияПакетаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ум_СостоянияПакетаДанных</name>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

1c_um/src/Catalogs/ум_СпособыОбработкиПакетов/ум_СпособыОбработкиПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ум_СпособыОбработкиПакетов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МногопоточноеИзменениеПакетовДанных</name>
      <description>Многопоточное изменение пакетов данных</description>
    </items>
    <items>
      <name>ОчисткаЛоговФЗ</name>
      <description>Очистка логов ФЗ</description>
    </items>
    <items>
      <name>ПакетыДанныхОбслуживание</name>
      <description>Регламентное обслуживание пакетов данных</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляРазработчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниУправляющегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаУправляющееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниРабочегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаРабочееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторнаяОбработкаПакетовСОшибками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутПовторнойОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПакетПриУспешнойОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутУдаленияПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбщийСписокОшибок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизвольныйКодОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйКодОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаПроизвольногоКодаОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОшибкиОбработкиПакетов</name>
    <attributes>
      <name>ОписаниеОшбики</name>
      <type>
        <types>CatalogRef.ум_ОписанияОшибокОбработкиПакетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

1c_um/src/CommonModules/ум_ПакетыДанных/Module.bsl
// Функция - Создание пакета данных.
//
// Параметры:
//  Данные						 - число - Произвольные данные
//  СпособОбработки				 - ИмяДляразработчика, наименование элемента, ссылка на элемент справочника ум_СпособыОбработкиПакетов
//  ДатаСледующейОбработкиПакета - Дата - Дата, после которой система будет пытаться обработать пакет данных
//  ДополнительнаяИнформация	 - Строка - Дополнительная информация о пакете данных
//  Комментарий					 - Строка - Произвольный комментарий к пакету данных
// 
// Возвращаемое значение:
//  Структура, содержащая поля: ИдентификаторПакета, Ошибка, ОписаниеОшибки 
Функция СоздатьПакетДанных(Данные, СпособОбработки, ДатаСледующейОбработкиПакета, ДополнительнаяИнформация = "", Комментарий = "") Экспорт
	
	Результат = Новый Структура("ИдентификаторПакета, Ошибка, ОписаниеОшибки");
	
	Результат.Ошибка = Ложь;
	
	ИдентификаторПакета = Новый УникальныйИдентификатор;
	
	НаборЗаписейПакетыДанных = РегистрыСведений.ум_ПакетыДанных.СоздатьНаборЗаписей();
	ПакетДанных = НаборЗаписейПакетыДанных.Добавить();
	
	Если ТипЗнч(СпособОбработки) = Тип("СправочникСсылка.ум_СпособыОбработкиПакетов") Тогда
		ТекСпособОбработки = СпособОбработки;
	ИначеЕсли ТипЗнч(СпособОбработки) = Тип("Строка") Тогда
		ИмяДляРазработчика = СокрЛП(СпособОбработки);
		ТекСпособОбработки = Справочники.ум_СпособыОбработкиПакетов.НайтиПоРеквизиту("ИмяДляРазработчика", ИмяДляРазработчика);
		Если НЕ ЗначениеЗаполнено(ТекСпособОбработки) Тогда
			Результат.Ошибка		 = Истина;
			Результат.ОписаниеОшибки = "Неожиданное имя для разработчика способа обработки пакета """ + ИмяДляРазработчика + """! Пакет не создан.";
			Возврат Результат;
		КонецЕсли;
	Иначе
		Результат.Ошибка			= Истина;
		Результат.ОписаниеОшибки	= "Неожиданное тип значения параметра ""СпособОбработки"": " + ТипЗнч(СпособОбработки) + "! Пакет не создан.";
		Возврат Результат;
	КонецЕсли;
	
	// создадим пакет данных
	ПакетДанных.ИдентификаторПакета		= ИдентификаторПакета; 
	ПакетДанных.ВременнаяМеткаСоздания	= ТекущаяУниверсальнаяДатаВМиллисекундах();
	ПакетДанных.ДатаСозданияПакета		= ТекущаяДатаСеанса();
	
	ПакетДанных.КлючАналитикиПакетаДанных = ум_ПакетыДанныхПовтИсп.ПолучитьКлючАналитикиПакетаДанных(ТекСпособОбработки, Перечисления.ум_СостоянияПакетаДанных.КОбработке);
	Если НЕ ЗначениеЗаполнено(ПакетДанных.КлючАналитикиПакетаДанных) Тогда
		Результат.Ошибка			= Истина;
		Результат.ОписаниеОшибки	= "Не найден ключ аналитики пакета данных! Способ обработки: "+ПакетДанных.СпособОбработки+". Состояние: "+Перечисления.ум_СостоянияПакетаДанных.КОбработке+".";
		Возврат Результат;
	КонецЕсли;
	
	ПакетДанных.ДатаСледующейОбработкиПакета= ДатаСледующейОбработкиПакета;
	ПакетДанных.КоличествоПопытокОбработки	= 0;
	
	ПакетДанных.ДополнительнаяИнформация	= ДополнительнаяИнформация;
	ПакетДанных.Комментарий					= Комментарий;
	
	// создадим данные пакета данных
	НаборЗаписейДанные = РегистрыСведений.ум_ПакетыДанныхДанные.СоздатьНаборЗаписей();
	ДанныеПакета = НаборЗаписейДанные.Добавить();
	
	ДанныеПакета.ИдентификаторПакета	= ИдентификаторПакета;
	ДанныеПакета.Данные 				= Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(1));
	
	Результат.ИдентификаторПакета	= ПакетДанных.ИдентификаторПакета;
	Результат.Вставить("ДатаСозданияПакета", ПакетДанных.ДатаСозданияПакета);
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Попытка
		НаборЗаписейПакетыДанных.Записать(Ложь); // нет смысла замещать набор записей, т.к. это гарантированно новая запись по новому УИД 
		НаборЗаписейДанные.Записать(Ложь);
	Исключение
		ОтменитьТранзакцию();
		Результат.Ошибка = Истина;
		Результат.ОписаниеОшибки = "Ошибка записи пакета! "+ОписаниеОшибки();
		Возврат Результат;
	КонецПопытки;
	ЗафиксироватьТранзакцию();
	
	Возврат Результат;
	
КонецФункции

// Процедура - Запуск обарботки пакета по идентификатору в сеансе пользователя
//
// Параметры:
//  ИдентификаторПакета			 - УникальныйИдентификатор - Уникальный идентификатор пакета данных
//
Процедура ОбработатьПакетДанныхВСеансеПользователя(ИдентификаторПакета) Экспорт
	
	ЗначенияРеквизитовПакета = ум_ПакетыДанныхОбработка.ЗначенияРеквизитовПакетаДанных(ИдентификаторПакета);
	
	Если Не ЗначениеЗаполнено(ЗначенияРеквизитовПакета.СпособОбработкиПакетов) Тогда 
		ВызватьИсключение "Не заполнен способ обработки пакета с идентификатором " + ИдентификаторПакета;
	КонецЕсли;
	
	ПараметрыСпособаОбработки = ум_ПакетыДанныхОбщегоНазначения.ПолучитьПараметрыСпособаОбработки(ЗначенияРеквизитовПакета.СпособОбработкиПакетов);
	ПараметрыСпособаОбработки.Вставить("ОбработкаПакетаВСеансеКлиента", Истина);
	
	МассивИдентификаторов = Новый Массив;
	МассивИдентификаторов.Добавить(ИдентификаторПакета);
	
	ум_ПакетыДанныхОбработка.ОбработчикРабочегоФЗ(МассивИдентификаторов, ПараметрыСпособаОбработки);
	
КонецПроцедуры
